tests/load/load-test.yml
config:
  target: "http://localhost/Bee/server/api"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Warm up and ramp up to 50 requests per second"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load of 50 requests per second"
  environments:
    production:
      target: "https://api.beechat.pro"
scenarios:
  - name: "Widget session check and heartbeat"
    flow:
      - get:
          url: "/leads.php?action=check_session&sessionId=loadtest_123&apiKey=DEMO_KEY"
      - think: 2
      - post:
          url: "/heartbeat.php"
          json:
            sessionId: "loadtest_123"
            apiKey: "DEMO_KEY"
  - name: "Chat messaging flow"
    weight: 2
    flow:
      - post:
          url: "/chat.php"
          json:
            apiKey: "DEMO_KEY"
            sessionId: "loadtest_123"
            message: "Hello, I need help"
            isOffline: false